art_share/app/controllers/artworks_controller.rb

    def index

        @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def create

        @artwork = Artwork.new(artwork_params)

        if @artwork.save
            redirect_to specific_art_url(Artwork.last.id)
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Applewatch"], ["image_url", "www.apple.com"], ["artist_id", 5], ["created_at", "2023-02-16 21:47:53.607147"], ["updated_at", "2023-02-16 21:47:53.607147"]]
SELECT "artworks".* FROM "artworks" ORDER BY "artworks"."id" DESC LIMIT $1  [["LIMIT", 1]]

    def show

        @artwork = Artwork.find(params[:slug])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]