art_share/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index

        @users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "smellymilner"], ["created_at", "2023-02-16 21:11:45.736755"], ["updated_at", "2023-02-16 21:11:45.736755"]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def create

        @user = User.new(user_params)

        if @user.save
            redirect_to user_url(User.last)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show

        @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "qq"], ["updated_at", "2023-02-16 21:24:20.550346"], ["id", 8]]
---
    def update

        @user = User.find(params[:id])

        if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
    def destroy

        @user = User.find(params[:id])

        if @user.destroy